import sqlite3

conn = sqlite3.connect('database_1.db')
cursor = conn.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS words (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        word TEXT
    )
""")
words = [
    "река", "озеро", "гора", "полуостров", "пустыня", "степь", "тундра", "плато", "берег", "пролив", "залив",
    "континент", "остров", "полуостров", "граница", "климат", "природа", "ландшафт", "вулкан", "гейзер", "водопад",
    "устье", "порт", "бухта", "материк", "канал", "область", "страна", "территория", "штат", "провинция", "регион",
    "население", "город", "село", "деревня", "столица", "мегаполис", "мегаполис", "мегаполис", "столица", "столица",
    "столица", "государство", "республика", "королевство", "империя", "демократия", "монархия", "правительство",
    "парламент", "конституция", "граница", "таможня", "виза", "паспорт", "география", "землетрясение", "цунами",
    "сейсмология", "вулканизм", "плиты", "тектоника", "полюс", "экватор", "параллель", "меридиан", "широта", "долгота",
    "глубина", "высота", "разлив", "прилив", "отлив", "пустыня", "степь", "тайга", "лес", "джунгли", "саванна",
    "тундра", "полюс", "климат", "погода", "ветер", "циклон", "антициклон", "муссон", "сезоны", "лето", "зима", "весна",
    "осень", "тропик", "экватор", "полярный", "арктика", "антарктика", "биосфера", "гидросфера", "атмосфера",
    "литосфера", "эрозия", "вулканизм", "тектоника", "гидрология", "климатология", "биом", "экосистема",
    "географическое", "карта", "глобус", "широта", "долгота", "масштаб", "экспедиция", "рельеф", "горный", "поле",
]
with open('words1.txt', 'w') as file:
    for item in words:
        file.write(str(item) + '\n')
with open('words1.txt', 'r') as file:
    for line in file:
        words.append(line.strip())
words_2 = [i for i in words if len(i) <= 10]
for word in words_2:
    cursor.execute("INSERT INTO words (word) VALUES (?)", (word,))
conn.commit()
conn.close()


conn = sqlite3.connect('database_2.db')
cursor = conn.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS words (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        word TEXT
    )
""")
words = ["античность", "феодализм", "революция", "монархия", "империя", "космогония", "колонизация", "племена",
         "германизация", "нацизм", "суверенитет", "апартеид", "рационализм", "атеизм", "патриархат", "феминизм",
         "боевая связь", "школьный социализм", "индустриализация", "конституция", "профсоюз", "забастовка",
         "религиозная политика", "клерикализм", "национализм", "коммунизм", "социализм", "капитализм", "империализм",
         "война", "мир", "колония", "демократия", "тоталитаризм", "монархия", "овладение", "завоевание", "перемирие",
         "подавление", "бунт", "трактат", "реформа", "диктатура", "анархия", "республика", "империя", "экспансия",
         "эксплуатация", "трактовка", "декрет", "сталенизм", "гетто", "холокост", "апокалипсис", "национализация",
         "деиндустриализация", "подчинение", "освобождение", "конфедерация", "глобализация", "аннексия", "распад",
         "стандартизация", "реконструкция", "компромисс", "партизанство", "оккупация", "сепаратизм", "движение",
         "политика", "конфликт", "цензура", "репрессия", "активист", "личность", "расизм", "фашизм", "имманентность",
         "бюрократия", "коллективизация", "договор", "жертва", "князь", "барон", "парламент"]
with open('words2.txt', 'w') as file:
    for item in words:
        file.write(str(item) + '\n')
with open('words2.txt', 'r') as file:
    for line in file:
        words.append(line.strip())
words_2 = [i for i in words if len(i) <= 10]
for word in words_2:
    cursor.execute("INSERT INTO words (word) VALUES (?)", (word,))
conn.commit()
conn.close()


conn = sqlite3.connect('database_3.db')
cursor = conn.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS words (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        word TEXT
    )
""")
words = ['Государство', 'Политика', 'Демократия', 'Идеология', 'Парламент', 'Президент', 'Конституция', 'Система',
         'Коммунизм', 'Капитализм', 'Социализм', 'Федерализм', 'Автократия', 'Тоталитаризм', 'Монополия', 'Олигархия',
         'Суверенитет', 'Территория', 'Нация', 'Общество', 'Правительство', 'Авторитет', 'Коррупция', 'Легитимность',
         'Бюрократия', 'Плюрализм', 'Лоббирование', 'Конфликт', 'Сотрудничество', 'Баллотироваться', 'Тоталитарный',
         'Политический', 'Партия', 'Идеолог', 'Власть', 'Глава', 'Законодательный', 'Исполнительный', 'Судебный',
         'Политическая', 'Институт', 'Корпорация', 'Управление', 'Масс-медиа', 'Манипуляция', 'Реклама', 'Демагогия',
         'Пропаганда', 'Лоббист', 'Революция', 'Реформа', 'Конституционный', 'Парламентарный', 'Авангард', 'Анархия',
         'Диктатура', 'Оппозиция', 'Депутат', 'Министерство', 'Правоохранительный', 'Судья', 'Жертва', 'Агитация',
         'Идеал', 'Терроризм', 'Военный', 'Пацифизм', 'Антиглобалист', 'Философия', 'Этика', 'Социология', 'Экономика',
         'Психология', 'История', 'Культурология', 'Религиоведение', 'Антропология', 'Национализм', 'Сепаратизм',
         'Автономия', 'Протест', 'Референдум', 'Акция', 'Манифестация', 'Митинг', 'Страйк', 'Общество', 'Класс',
         'Интернационализм', 'Политический', 'Социальный', 'Экономический', 'Культурный', 'Авторитарный', 'Суверенный',
         'Бюрократ', 'Гражданское', 'Потребление', 'Закон', 'Представление', 'Приемник', 'Структура', 'Государственный',
         'Парламентаризм', 'Монетаризм', 'Либерализм', 'Национал-социализм', 'Фашизм', 'Неонацизм', 'Антисемитизм',
         'Колониализм', 'Империализм', 'Коммунистический', 'Классовый', 'Женщина', 'Властный', 'Клан', 'Группа',
         'Раскол', 'Коллективизация', 'Конкуренция', 'Кризис', 'Противоречие', 'Тоталитарное', 'Демократический',
         'Партийный', 'Политическая', 'Финансовый', 'Автоматизация', 'Индустриализация', 'Деформация', 'Общественный',
         ]
with open('words3.txt', 'w') as file:
    for item in words:
        file.write(str(item) + '\n')
with open('words3.txt', 'r') as file:
    for line in file:
        words.append(line.strip())
words_2 = [i for i in words if len(i) <= 10]
for word in words_2:
    cursor.execute("INSERT INTO words (word) VALUES (?)", (word,))
conn.commit()
conn.close()


conn = sqlite3.connect('database_4.db')
cursor = conn.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS words (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        word TEXT
    )
""")
words = [
    'дверь', 'окно', 'кухня', 'спальня', 'ванная', 'гостиная', 'стол', 'стул', 'диван', 'ковер',
    'зеркало', 'полка', 'лампа', 'стекло', 'тумбочка', 'ковер', 'шторы', 'потолок', 'стена', 'кресло',
    'подушка', 'одеяло', 'шкаф', 'пол', 'камин', 'чайник', 'тарелка', 'ложка', 'вилка', 'нож',
    'холодильник', 'микроволновка', 'плита', 'чашка', 'компьютер', 'книга', 'столешница', 'телевизор',
    'зеркало', 'телефон', 'пульт', 'клавиатура', 'мышь', 'плед', 'подушка', 'коврик', 'тапочки',
    'полотенце', 'фоторамка', 'пылесос', 'картина', 'панель', 'коврик', 'прокладка', 'полотенце', 'занавеска',
    'настольная лампа', 'потолочная лампа', 'люстра', 'тапеты', 'балкон', 'диван', 'пуфик', 'занавески',
    'барная стойка', 'прихожая', 'замок', 'ключ', 'крыша', 'фундамент', 'балкон', 'терраса', 'погреб',
    'подвал', 'чердак', 'котел', 'батарея', 'светильник', 'тепловентилятор', 'мебель', 'крючок', 'петля',
    'полка', 'шкафчик', 'кровать', 'тумбочка', 'зеркало', 'стеллаж', 'лестница', 'перила', 'плитка',
    'ванна', 'душ', 'раковина', 'полотенцесушитель', 'полотенце', 'дозатор', 'зубная щетка', 'зубная паста',
    'туалет', 'фен', 'шампунь', 'гель для душа', 'полотенце', 'шкафчик', 'коврик', 'умывальник', 'зеркало',
    'полка', 'подсветка', 'гардероб', 'потолок', 'настенная полка', 'лестница', 'перила', 'пол', 'ковер',
    'мебель', 'люстра', 'светильник', 'занавески', 'подоконник', 'полка', 'ковер', 'табурет', 'постель',
    'наволочка', 'одеяло', 'подушка', 'простыня', 'покрывало', 'плед', 'декор', 'картина', 'фоторамка',
    'занавески', 'статуэтка', 'ваза', 'ковер', 'табурет', 'столик', 'коврик', 'полка', 'подставка',
    'декор', 'цветок', 'горшок', 'подоконник', 'стеллаж', 'ковер', 'плитка', 'паркет', 'ковролин',
    'дверной косяк', 'порог', 'замок', 'ручка', 'крючок', 'петля', 'пробка', 'трещотка', 'напольная плитка',
    'паркет', 'ковролин', 'ламинат', 'дверь', 'окно', 'жалюзи', 'решетка', 'подоконник', 'декор', 'пол',
    'плинтус', 'подсветка', 'радиатор', 'батарея', 'термостат', 'тепловентилятор', 'датчик', 'газ', 'вода',
    'электричество', 'кабель', 'розетка', 'выключатель', 'лампочка', 'лампа', 'провод', 'розетка', 'вилка',
    'выключатель', 'переключатель', 'розетка', 'провод', 'кабель', 'вилка', 'выключатель', 'электричество',
    'газ', 'вода', 'розетка', 'выключатель', 'переключатель', 'кнопка', 'кабель', 'провод', 'лампочка',
    'лампа', 'светильник', 'датчик', 'блок', 'розетка', 'выключатель', 'кнопка', 'переключатель', 'датчик',
    'газ', 'вода', 'электричество', 'кабель', 'розетка', 'выключатель', 'лампа', 'лампочка', 'светильник',
    'потолочная лампа', 'стеновая лампа', 'ночник', 'лампочка', 'лампа', 'светильник', 'датчик', 'газ',
    'вода', 'электричество', 'кабель', 'розетка', 'выключатель', 'лампочка', 'светильник', 'стеновая лампа',
    'потолочная лампа']
with open('words4.txt', 'w') as file:
    for item in words:
        file.write(str(item) + '\n')
with open('words4.txt', 'r') as file:
    for line in file:
        words.append(line.strip())
words_2 = [i for i in words if len(i) <= 10]
for word in words_2:
    cursor.execute("INSERT INTO words (word) VALUES (?)", (word,))
conn.commit()
conn.close()
